; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l10-t1-p5---int100n150-m25---int100c110---s169---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level9 level9)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level9 level10)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level9 level11)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level9 level12)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level9 level13)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level9 level14)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level9 level15)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level9 level16)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level9 level17)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level9 level18)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level9 level19)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level9 level20)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level9 level21)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level9 level22)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level9 level23)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level9 level24)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level9 level25)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level9 level26)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level9 level27)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level9 level28)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level9 level29)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level9 level30)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level9 level31)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level9 level32)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level9 level33)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level9 level34)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level9 level35)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level9 level36)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level9 level37)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level9 level38)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level9 level39)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level9 level40)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level9 level41)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level9 level42)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level9 level43)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level9 level44)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level9 level45)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level9 level46)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level9 level47)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level9 level48)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level9 level49)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level9 level50)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level9 level51)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level9 level52)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level9 level53)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level9 level54)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level9 level55)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level9 level56)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level9 level57)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level9 level58)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level9 level59)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level9 level60)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level9 level61)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level53 level9 level62)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level54 level9 level63)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level55 level9 level64)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level56 level9 level65)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level56 level25 level81)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level57 level9 level66)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level57 level25 level82)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level58 level9 level67)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level58 level25 level83)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level59 level9 level68)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level22 level81)
(sum level59 level25 level84)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level60 level9 level69)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level60 level22 level82)
(sum level60 level25 level85)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level61 level9 level70)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level61 level22 level83)
(sum level61 level25 level86)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level6 level68)
(sum level62 level7 level69)
(sum level62 level9 level71)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level62 level22 level84)
(sum level62 level25 level87)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level6 level69)
(sum level63 level7 level70)
(sum level63 level9 level72)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level63 level22 level85)
(sum level63 level25 level88)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level6 level70)
(sum level64 level7 level71)
(sum level64 level9 level73)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level64 level22 level86)
(sum level64 level25 level89)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level6 level71)
(sum level65 level7 level72)
(sum level65 level9 level74)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level65 level22 level87)
(sum level65 level25 level90)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level6 level72)
(sum level66 level7 level73)
(sum level66 level9 level75)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level66 level22 level88)
(sum level66 level25 level91)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level6 level73)
(sum level67 level7 level74)
(sum level67 level9 level76)
(sum level67 level19 level86)
(sum level67 level20 level87)
(sum level67 level22 level89)
(sum level67 level25 level92)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level6 level74)
(sum level68 level7 level75)
(sum level68 level9 level77)
(sum level68 level19 level87)
(sum level68 level20 level88)
(sum level68 level22 level90)
(sum level68 level25 level93)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level69 level6 level75)
(sum level69 level7 level76)
(sum level69 level9 level78)
(sum level69 level19 level88)
(sum level69 level20 level89)
(sum level69 level22 level91)
(sum level69 level25 level94)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level70 level6 level76)
(sum level70 level7 level77)
(sum level70 level9 level79)
(sum level70 level19 level89)
(sum level70 level20 level90)
(sum level70 level22 level92)
(sum level70 level25 level95)
(sum level71 level2 level73)
(sum level71 level3 level74)
(sum level71 level6 level77)
(sum level71 level7 level78)
(sum level71 level9 level80)
(sum level71 level19 level90)
(sum level71 level20 level91)
(sum level71 level22 level93)
(sum level72 level2 level74)
(sum level72 level3 level75)
(sum level72 level6 level78)
(sum level72 level7 level79)
(sum level72 level9 level81)
(sum level72 level19 level91)
(sum level72 level20 level92)
(sum level72 level22 level94)
(sum level73 level2 level75)
(sum level73 level3 level76)
(sum level73 level6 level79)
(sum level73 level7 level80)
(sum level73 level9 level82)
(sum level73 level19 level92)
(sum level73 level20 level93)
(sum level73 level22 level95)
(sum level74 level2 level76)
(sum level74 level3 level77)
(sum level74 level6 level80)
(sum level74 level7 level81)
(sum level74 level9 level83)
(sum level74 level19 level93)
(sum level74 level20 level94)
(sum level75 level2 level77)
(sum level75 level3 level78)
(sum level75 level6 level81)
(sum level75 level7 level82)
(sum level75 level9 level84)
(sum level75 level19 level94)
(sum level75 level20 level95)
(sum level76 level2 level78)
(sum level76 level3 level79)
(sum level76 level6 level82)
(sum level76 level7 level83)
(sum level76 level9 level85)
(sum level76 level19 level95)
(sum level77 level2 level79)
(sum level77 level3 level80)
(sum level77 level6 level83)
(sum level77 level7 level84)
(sum level77 level9 level86)
(sum level78 level2 level80)
(sum level78 level3 level81)
(sum level78 level6 level84)
(sum level78 level7 level85)
(sum level78 level9 level87)
(sum level79 level2 level81)
(sum level79 level3 level82)
(sum level79 level6 level85)
(sum level79 level7 level86)
(sum level79 level9 level88)
(sum level80 level2 level82)
(sum level80 level3 level83)
(sum level80 level6 level86)
(sum level80 level7 level87)
(sum level80 level9 level89)
(sum level81 level2 level83)
(sum level81 level3 level84)
(sum level81 level6 level87)
(sum level81 level7 level88)
(sum level81 level9 level90)
(sum level82 level2 level84)
(sum level82 level3 level85)
(sum level82 level6 level88)
(sum level82 level7 level89)
(sum level82 level9 level91)
(sum level83 level2 level85)
(sum level83 level3 level86)
(sum level83 level6 level89)
(sum level83 level7 level90)
(sum level83 level9 level92)
(sum level84 level2 level86)
(sum level84 level3 level87)
(sum level84 level6 level90)
(sum level84 level7 level91)
(sum level84 level9 level93)
(sum level85 level2 level87)
(sum level85 level3 level88)
(sum level85 level6 level91)
(sum level85 level7 level92)
(sum level85 level9 level94)
(sum level86 level2 level88)
(sum level86 level3 level89)
(sum level86 level6 level92)
(sum level86 level7 level93)
(sum level86 level9 level95)
(sum level87 level2 level89)
(sum level87 level3 level90)
(sum level87 level6 level93)
(sum level87 level7 level94)
(sum level88 level2 level90)
(sum level88 level3 level91)
(sum level88 level6 level94)
(sum level88 level7 level95)
(sum level89 level2 level91)
(sum level89 level3 level92)
(sum level89 level6 level95)
(sum level90 level2 level92)
(sum level90 level3 level93)
(sum level91 level2 level93)
(sum level91 level3 level94)
(sum level92 level2 level94)
(sum level92 level3 level95)
(sum level93 level2 level95)

(connected l0 l2)
(fuelcost level7 l0 l2)
(connected l0 l6)
(fuelcost level20 l0 l6)
(connected l0 l8)
(fuelcost level20 l0 l8)
(connected l1 l6)
(fuelcost level22 l1 l6)
(connected l1 l8)
(fuelcost level25 l1 l8)
(connected l2 l0)
(fuelcost level7 l2 l0)
(connected l2 l3)
(fuelcost level22 l2 l3)
(connected l2 l4)
(fuelcost level3 l2 l4)
(connected l3 l2)
(fuelcost level22 l3 l2)
(connected l3 l5)
(fuelcost level2 l3 l5)
(connected l3 l7)
(fuelcost level2 l3 l7)
(connected l4 l2)
(fuelcost level3 l4 l2)
(connected l4 l7)
(fuelcost level7 l4 l7)
(connected l5 l3)
(fuelcost level2 l5 l3)
(connected l5 l6)
(fuelcost level9 l5 l6)
(connected l5 l9)
(fuelcost level20 l5 l9)
(connected l6 l0)
(fuelcost level20 l6 l0)
(connected l6 l1)
(fuelcost level22 l6 l1)
(connected l6 l5)
(fuelcost level9 l6 l5)
(connected l6 l9)
(fuelcost level19 l6 l9)
(connected l7 l3)
(fuelcost level2 l7 l3)
(connected l7 l4)
(fuelcost level7 l7 l4)
(connected l7 l8)
(fuelcost level6 l7 l8)
(connected l8 l0)
(fuelcost level20 l8 l0)
(connected l8 l1)
(fuelcost level25 l8 l1)
(connected l8 l7)
(fuelcost level6 l8 l7)
(connected l8 l9)
(fuelcost level3 l8 l9)
(connected l9 l5)
(fuelcost level20 l9 l5)
(connected l9 l6)
(fuelcost level19 l9 l6)
(connected l9 l8)
(fuelcost level3 l9 l8)

(at t0 l1)
(fuel t0 level95)
(= (total-cost) 0)

(at p0 l4)
(at p1 l8)
(at p2 l7)
(at p3 l0)
(at p4 l6)
)

(:goal
(and
(at p0 l0)
(at p1 l4)
(at p2 l2)
(at p3 l9)
(at p4 l8)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l8 level70 level25 level95)
   deleted: (at t0 l1) (fuel t0 level95)
   added: (at t0 l8) (fuel t0 level70)
   goals met: 0 of 5
2. (load p1 t0 l8)
   deleted: (at p1 l8)
   added: (in p1 t0)
   goals met: 0 of 5
3. (drive t0 l8 l7 level64 level6 level70)
   deleted: (at t0 l8) (fuel t0 level70)
   added: (at t0 l7) (fuel t0 level64)
   goals met: 0 of 5
4. (load p2 t0 l7)
   deleted: (at p2 l7)
   added: (in p2 t0)
   goals met: 0 of 5
5. (drive t0 l7 l4 level57 level7 level64)
   deleted: (at t0 l7) (fuel t0 level64)
   added: (at t0 l4) (fuel t0 level57)
   goals met: 0 of 5
6. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 1 of 5
7. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 1 of 5
8. (drive t0 l4 l2 level54 level3 level57)
   deleted: (at t0 l4) (fuel t0 level57)
   added: (at t0 l2) (fuel t0 level54)
   goals met: 1 of 5
9. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 5
10. (drive t0 l2 l0 level47 level7 level54)
   deleted: (at t0 l2) (fuel t0 level54)
   added: (at t0 l0) (fuel t0 level47)
   goals met: 2 of 5
11. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 2 of 5
12. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 3 of 5
13. (drive t0 l0 l6 level27 level20 level47)
   deleted: (at t0 l0) (fuel t0 level47)
   added: (at t0 l6) (fuel t0 level27)
   goals met: 3 of 5
14. (load p4 t0 l6)
   deleted: (at p4 l6)
   added: (in p4 t0)
   goals met: 3 of 5
15. (drive t0 l6 l9 level8 level19 level27)
   deleted: (at t0 l6) (fuel t0 level27)
   added: (at t0 l9) (fuel t0 level8)
   goals met: 3 of 5
16. (unload p3 t0 l9)
   deleted: (in p3 t0)
   added: (at p3 l9)
   goals met: 4 of 5
17. (drive t0 l9 l8 level5 level3 level8)
   deleted: (at t0 l9) (fuel t0 level8)
   added: (at t0 l8) (fuel t0 level5)
   goals met: 4 of 5
18. (unload p4 t0 l8)
   deleted: (in p4 t0)
   added: (at p4 l8)
   goals met: 5 of 5
